posts/how-to-write-a-blog-using-nikola/index.html
<!DOCTYPE html>
<html prefix="
" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>mindtoilet · Blogging using nikola, github, emacs, orgmode </title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=PT+Sans:400,400italic,700%7CAbril+Fatface">
<meta content="#5670d4" name="theme-color">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://mindtoilet.github.io/posts/how-to-write-a-blog-using-nikola/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="mind">
<link rel="next" href="../i-am-not-from-hitherto/" title="I am not from hitherto" type="text/html">
</head>
<body class="">
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

    <div class="hsidebar">
        <div class="container sidebar-sticky">
            <div class="sidebar-about">
              <h1>
                <a href="https://mindtoilet.github.io/">
                      <h1 id="brand"><a href="https://mindtoilet.github.io/" title="mindtoilet" rel="home">

        <span id="blog-title">mindtoilet</span>
    </a></h1>

                </a>
              </h1>
                <p class="lead">Where flush ideas.?</p>

            </div>
                <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../archive.html">Archive</a>
        <a class="sidebar-nav-item" href="../../categories/">Tags</a>
        <a class="sidebar-nav-item" href="../../rss.xml">RSS feed</a>
    
    
    </nav><footer id="footer"><span class="copyright">
              Contents © 2020         <a href="mailto:mindtoilet@gmail.com">mind</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            </span>
            
            
        </footer>
</div>
    </div>

    <div class="content container" id="content">
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><h1 class="post-title p-name"><a href="." class="u-url">Blogging using nikola, github, emacs, orgmode</a></h1>

    <span class="post-date">
      <time class="published dt-published" datetime="2018-02-09T01:38:14+05:30" itemprop="datePublished" title="2018-02-09 01:38">2018-02-09 01:38</time></span>

    
    

    <div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org292083a" class="outline-2">
<h2 id="org292083a"><code>Blog about writing blogs</code></h2>
<div class="outline-text-2" id="text-org292083a">
<p>
This blog about writing blogs is upon request by pestering
friends. Thanks to all other blogs about writing blogs.
</p>
<hr>
</div>
</div>
<div id="outline-container-orgb70ad56" class="outline-2">
<h2 id="orgb70ad56"><code>To know these exist</code></h2>
<div class="outline-text-2" id="text-orgb70ad56">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="org-left"></colgroup>
<colgroup><col class="org-left"></colgroup>
<thead><tr>
<th scope="col" class="org-left"><a href="https://getnikola.com/">Nikola</a></th>
<th scope="col" class="org-left">Static website generator</th>
</tr></thead>
<tbody><tr>
<td class="org-left"><a href="https://guides.github.com/activities/hello-world/">Github</a></td>
<td class="org-left">Free website hosting</td>
</tr></tbody>
<tbody><tr>
<td class="org-left"><a href="https://www.gnu.org/software/emacs/tour/">emacs</a></td>
<td class="org-left">Emacs : A wonderful text editor</td>
</tr></tbody>
<tbody><tr>
<td class="org-left"><a href="https://en.wikipedia.org/wiki/Org-mode">orgmode</a></td>
<td class="org-left">Headings, Tables, Text formatting, Genetically Awesome!!!</td>
</tr></tbody>
<tbody><tr>
<td class="org-left"><a href="http://docs.python-guide.org/en/latest/dev/virtualenvs/">Python virtual environment</a></td>
<td class="org-left">A special work place without pollution</td>
</tr></tbody>
</table>
<p>
Curious Columbus-es should then follow the links.
(or) If you just want to get your blog up and running then,
bother not, you shall.
</p>
<hr>
</div>
</div>
<div id="outline-container-org936ed83" class="outline-2">
<h2 id="org936ed83"><code>Well</code></h2>
<div class="outline-text-2" id="text-org936ed83">
<p>
The idea is to create a blogging website hosted in <i>Github</i>, using a
static site generator software <i>Nikola</i>, with the help of <i>Python
virtual environment</i> and then write blog posts using <i>emacs org mode</i>.
</p>
</div>
<div id="outline-container-org9128d01" class="outline-4">
<h4 id="org9128d01">Also</h4>
<div class="outline-text-4" id="text-org9128d01">
<ol class="org-ol">
<li>I'm using Linux.</li>
<li>I will be assuming the name of your blog as 'bottle'</li>
</ol>
<hr>
</div>
</div>
</div>
<div id="outline-container-orgcfb74cd" class="outline-2">
<h2 id="orgcfb74cd"><code>GitHub</code></h2>
<div class="outline-text-2" id="text-orgcfb74cd">
<blockquote>
<p>
<code>git</code> : <i>(British)</i> a foolish or worthless person
</p>

<p>
– Merriam-Webster
</p>
</blockquote>

<p>
So, keeping that in mind:
</p>
<ol class="org-ol">
<li>Create a GitHub account with username 'bottle'</li>
<li>Create a repository with the following name:'bottle.github.io'</li>
<li>
<a href="https://guides.github.com/activities/hello-world/">Instructions</a>.</li>
</ol>
<p>
Once done this, GitHub will host your website in the following
address(URL) : <a href="https://bottle.github.io/">https://bottle.github.io/</a>
</p>

<p>
Clone(copy) this newborn repository into your local machine a.k.a
personal computer by using the following command:
</p>
<div class="highlight"><pre><span></span>git clone https://bottle.github.io/ <span class="nv">$HOME</span>/projects/bottle
</pre></div>

<p>
You will be adding blog posts in ~/projects/bottle directory and will
push them back to GitHub later.
</p>
<hr>
</div>
</div>
<div id="outline-container-org45f1533" class="outline-2">
<h2 id="org45f1533"><code>Python Virtual Environment</code></h2>
<div class="outline-text-2" id="text-org45f1533">
<p>
If you haven't heard the news yet, Python is a programming
language and Python 3 is here to stay.
</p>

<p>
Python Virtual environment basically copies python scripts to create a
new workplace. You could install custom python packages specific to your
project. This means packages used for one project will not pollute
another project.
</p>

<p>
For e.g. if you wish to have a separate working environment for
cooking vegetables, where you don't want nikola to be installed, 
create a virtual environment called vegetables. 
</p>
</div>
<div id="outline-container-orgbb340bd" class="outline-3">
<h3 id="orgbb340bd">Virtual environment wrapper</h3>
<div class="outline-text-3" id="text-orgbb340bd">
<p>
Gift-wrapped python virtual environment commands.
For ease of use. No need to remember too many virtualenv commands.
</p>


<p>
Let "$HOME/virenvs" be our directory for all environments.
</p>
<blockquote>
<p>
<code>As always, names doesn't matter. It is what you do that defines you - Spiderman's ex-girlfriend</code>
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org3addd03" class="outline-3">
<h3 id="org3addd03">Steps</h3>
<div class="outline-text-3" id="text-org3addd03">
<p>
Make sure you have pip (python package manager) installed in your machine.
And follow the steps :
</p>
<div class="highlight"><pre><span></span>pip install virtualenv
pip install virtualenvwrapper
<span class="nb">export</span> <span class="nv">WORKON_HOME</span><span class="o">=</span><span class="nv">$HOME</span>/virenvs
<span class="nb">source</span> /usr/local/bin/virtualenvwrapper.sh
mkvirtualenv bottle
workon bottle
</pre></div>

<p>
Now you should see that you have entered the 'bottle' environment.
</p>
<hr>
</div>
</div>
</div>
<div id="outline-container-org2bce832" class="outline-2">
<h2 id="org2bce832"><code>Nikola</code></h2>
<div class="outline-text-2" id="text-org2bce832">
<p>
If you are inside the bottle, then you are ready to install <i>nikola</i>, the
static site generator.
</p>
</div>
<div id="outline-container-orgc1a0174" class="outline-3">
<h3 id="orgc1a0174">Installation</h3>
<div class="outline-text-3" id="text-orgc1a0174">
<div class="highlight"><pre><span></span>pip install --upgrade pip <span class="s1">'Nikola[extras]'</span>
nikola plugin -i orgmode
<span class="nb">cd</span> <span class="nv">$HOME</span>/projects/bottle
git checkout -b sources
</pre></div>

<p>
add a .gitignore file to <code>$HOME/projects/bottle</code> folder with the
following content in it.
</p>

<div class="highlight"><pre><span></span>*.py<span class="o">[</span>cod<span class="o">]</span>
__pycache__
cache
output
.doit.db
</pre></div>

<p>
commit this to git
</p>

<div class="highlight"><pre><span></span>git add .gitignore
git commit -m <span class="s2">"Add .gitignore"</span>
</pre></div>
</div>
</div>
<div id="outline-container-orgcab6eb6" class="outline-3">
<h3 id="orgcab6eb6">Website</h3>
<div class="outline-text-3" id="text-orgcab6eb6">
<p>
Create a website using nikola
</p>
<div class="highlight"><pre><span></span>nikola init bottle
</pre></div>
<p>
Fill in the form that follows.
</p>

<p>
It should show a success message after form is filled.
Now, nikola will create a new folder called bottle inside
<code>$HOME/projects/bottle</code>, which is unnecessary. So move its contents to
<code>$HOME/projects/bottle</code> folder and delete the extra bottle.
</p>
<div class="highlight"><pre><span></span>mv my_first_site/* .
rm -r my_first_site
</pre></div>


<p>
Your new site 'bottle' can be viewed either locally or globally(using
a new technology called internet). The latter will be done later.
</p>

<p>
To view your recently created site locally, 
</p>
<div class="highlight"><pre><span></span>nikola build
nikola serve
</pre></div>

<p>
Open browser and enter <i>localhost:8000</i> in the URL bar !
</p>

<p>
To stop the localhost web service in the terminal hit Ctrl-c.
</p>
<hr>
</div>
</div>
<div id="outline-container-org923d661" class="outline-3">
<h3 id="org923d661">Posts</h3>
<div class="outline-text-3" id="text-org923d661">
<p>
Now, you would want to flush your ideas into blogs. That could be
easily accomplished.
</p>

<div class="highlight"><pre><span></span>nikola new_post -e
</pre></div>
<p>
The -e option will open the post in your text editor of choice;
</p>

<p>
Movimg on from editor of your choice,
</p>
</div>

<ul class="org-ul">
<li>
<a id="orgefed946"></a>Emacs Org-mode<br><div class="outline-text-5" id="text-orgefed946">
<p>
Every great software application is a file with some text in it and
<code>Emacs is a text file editor</code>
</p>

<p>
The best way to get started with Emacs is to follow its built-in
tutorial. Open Emacs and press Ctrl-h t. 
Emacs tastes best when customized. Help is available at <a href="http://cestlaz.github.io/stories/emacs/">using emacs</a>.
</p>

<p>
org-mode in itself is the biggest reason people fall in love with
Emacs so easily. <a href="https://www.youtube.com/watch?v=SzA2YODtgK4">I like org mode introduction by Harry Schwartz</a>.
</p>

<p>
Two cool things in org-mode that I must mention:
</p>
<ol class="org-ol">
<li>creating tables <code>|Name|Age &lt;tab&gt;</code>
</li>
<li>exporting to html/pdf/LaTeX/odt/iCal … <code>Ctrl-c Ctrl-e</code>
</li>
</ol>
<hr>
</div>
</li>
<li>
<a id="org6c82171"></a>To write a new blog post in Emacs org-mode<br><div class="outline-text-5" id="text-org6c82171">
<p>
You've already installed org mode plugin for nikola in your
installation process. 
</p>

<p>
Now, append the following to your <code>conf.py</code> file(available in bottle
folder)
</p>

<div class="highlight"><pre><span></span><span class="c1"># Add the orgmode compiler to your COMPILERS dict.</span>
<span class="n">COMPILERS</span><span class="p">[</span><span class="s2">"orgmode"</span><span class="p">]</span> <span class="o">=</span> <span class="p">(</span><span class="s1">'.org'</span><span class="p">,)</span>

<span class="c1"># Add org files to your POSTS, PAGES</span>
<span class="n">POSTS</span> <span class="o">=</span> <span class="n">POSTS</span> <span class="o">+</span> <span class="p">((</span><span class="s2">"posts/*.org"</span><span class="p">,</span> <span class="s2">"posts"</span><span class="p">,</span> <span class="s2">"post.tmpl"</span><span class="p">),)</span>
<span class="n">PAGES</span> <span class="o">=</span> <span class="n">PAGES</span> <span class="o">+</span> <span class="p">((</span><span class="s2">"stories/*.org"</span><span class="p">,</span> <span class="s2">"stories"</span><span class="p">,</span> <span class="s2">"story.tmpl"</span><span class="p">),)</span>
</pre></div>

<p>
Now, to write a post using org-mode,
</p>
<div class="highlight"><pre><span></span>nikola new_post -e -f orgmode
</pre></div>
</div>
</li>
</ul>
</div>

<div id="outline-container-org144f304" class="outline-3">
<h3 id="org144f304">Comments</h3>
<div class="outline-text-3" id="text-org144f304">
<p>
If you like using disqus as the commenting system then:
</p>
<ol class="org-ol">
<li>Create a disqus account</li>
<li>Login and click on your picture at top right and select install on site</li>
<li>Fill in necessary details. If you don't see nikola platform in the
list, don't worry, skip that and go to next page. If the next page is about
installing manually by adding code where you want disqus to appear,
SKIP that as well.</li>
<li>Go to the last step and finish the configuration</li>
<li>At the end of setup, you should see your disqus short name.</li>
<li>That is your disqus ID you need to add in your <code>conf.py</code> file</li>
</ol>
<div class="highlight"><pre><span></span><span class="c1"># To use comments, you can choose between different third party comment</span>
<span class="c1"># systems.  The following comment systems are supported by Nikola:</span>
<span class="c1">#   disqus, facebook, googleplus, intensedebate, isso, livefyre, muut</span>
<span class="c1"># You can leave this option blank to disable comments.</span>
<span class="n">COMMENT_SYSTEM</span> <span class="o">=</span> <span class="s2">"disqus"</span>
<span class="c1"># And you also need to add your COMMENT_SYSTEM_ID which</span>
<span class="c1"># depends on what comment system you use. The default is</span>
<span class="c1"># "nikolademo" which is a test account for Disqus. More information</span>
<span class="c1"># is in the manual.</span>
<span class="n">COMMENT_SYSTEM_ID</span> <span class="o">=</span> <span class="s2">"your_disqus_account_id"</span>
</pre></div>
</div>
</div>

<div id="outline-container-org8b2cd75" class="outline-3">
<h3 id="org8b2cd75">Publish</h3>
<div class="outline-text-3" id="text-org8b2cd75">
</div>
<div id="outline-container-org4918c66" class="outline-4">
<h4 id="org4918c66">To launch the site in local host</h4>
<div class="outline-text-4" id="text-org4918c66">
<div class="highlight"><pre><span></span>nikola build
nikola serve
</pre></div>

<p>
The 'nikola auto' command automatically updates the local site for
every change you make to your post.
</p>
<div class="highlight"><pre><span></span>nikola auto
</pre></div>
</div>
</div>

<div id="outline-container-org7f1433a" class="outline-4">
<h4 id="org7f1433a">To publish your blog to the so called internet,</h4>
<div class="outline-text-4" id="text-org7f1433a">
<p>
Edit the <code>conf.py</code> file and change these following variables. This helps
in keeping the master branch of GitHub page less crowded.
</p>

<div class="highlight"><pre><span></span><span class="n">GITHUB_SOURCE_BRANCH</span> <span class="o">=</span> <span class="s1">'sources'</span>
<span class="n">GITHUB_DEPLOY_BRANCH</span> <span class="o">=</span> <span class="s1">'master'</span>
</pre></div>

<div class="highlight"><pre><span></span>nikola github_deploy
</pre></div>

<p>
And visit <a href="https://bottle.github.io">https://bottle.github.io</a>
</p>
<hr>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfad0dcb" class="outline-2">
<h2 id="orgfad0dcb"><code>Thanks</code></h2>
<div class="outline-text-2" id="text-orgfad0dcb">
<p>
For detailed information : 
</p>

<ol class="org-ol">
<li><a href="http://streakycobra.github.io/posts/blogging-in-org-mode-with-nikola/">streakycobra</a></li>
<li><a href="http://cestlaz.github.io/posts/using-emacs-35-blogging/">C'est la Z</a></li>
<li><a href="http://docs.python-guide.org/en/latest/dev/virtualenvs/">The Hitchhiker's guide to Python</a></li>
<li><a href="https://getnikola.com/getting-started.html">nikola</a></li>
<li><a href="http://cestlaz.github.io/stories/emacs/">using emacs</a></li>
<li><a href="https://www.youtube.com/watch?v=SzA2YODtgK4">Getting started with org mode</a></li>
<li><a href="https://www.youtube.com/watch?v=oJTwQvgfgMM">org mode : by its creator</a></li>
</ol>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><p itemprop="keywords" class="tags">
            <span class="tag"><a class="p-category" href="../../categories/blogging/" rel="tag">blogging</a></span>
            <span class="tag"><a class="p-category" href="../../categories/emacs/" rel="tag">emacs</a></span>
            <span class="tag"><a class="p-category" href="../../categories/github/" rel="tag">github</a></span>
            <span class="tag"><a class="p-category" href="../../categories/linux/" rel="tag">linux</a></span>
            <span class="tag"><a class="p-category" href="../../categories/nikola/" rel="tag">nikola</a></span>
            <span class="tag"><a class="p-category" href="../../categories/orgmode/" rel="tag">orgmode</a></span>
            <span class="tag"><a class="p-category" href="../../categories/python/" rel="tag">python</a></span>
      </p>

            <div class="pager hidden-print pagination">

            <span class="previous pagination-item older">
                Previous post
            </span>


            <span class="next pagination-item newer">
                <a href="../i-am-not-from-hitherto/" rel="next" title="I am not from hitherto">
Next post
              </a>
            </span>

        </div>

    </nav></aside><section class="comments hidden-print"><h2>Comments</h2>
                        <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="https-mindtoilet-github-io",
            disqus_url="https://mindtoilet.github.io/posts/how-to-write-a-blog-using-nikola/",
        disqus_title="Blogging using nikola, github, emacs, orgmode",
        disqus_identifier="cache/posts/how-to-write-a-blog-using-nikola.html",
        disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        </section></article><script>var disqus_shortname="https-mindtoilet-github-io";(function(){var a=document.createElement("script");a.async=true;a.src="https://"+disqus_shortname+".disqus.com/count.js";(document.getElementsByTagName("head")[0]||document.getElementsByTagName("body")[0]).appendChild(a)}());</script>
</div>
            <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
